app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]
---
  <%= render @article.comments %>
 <!--  <% @article.comments.each do |comment| %>