app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hello "], ["text", "World"], ["created_at", "2018-05-23 14:30:31.903366"], ["updated_at", "2018-05-23 14:30:31.903366"]]
---
  def create
	  @article = Article.new(params[:article].permit(:text, :title))

   	if @article.save